In [3]:
#importing the packages
import pandas as pd
df = pd.read_csv("D:\\EMPLOYEE_DATA_ANALYSIS\\Python\\emp_salary_data.csv")
print(df.head(5))

  emp id first name last name                  department    join date  \
0  CU025    Aubr#ey     Clark  Customer Support & Service   4-Jan-2012
1  CU026    Preston     Clark  Customer Support & Service   4-Jan-2012
2  CU031  Josephine    Meyers  Customer Support & Service   5-Jan-2012
3  CU041      Irene      Ward  Customer Support & Service  14-Jan-2012
4  CU050      Faith  Gonzales  Customer Support & Service  19-Jan-2012

  monthly salary   birth date
0           6700  29-Mar-1956
1           6700  12-Apr-1956
2           6900   5-Nov-1989
3           6600  20-Sep-1960
4           6500  21-Oct-1961

In [28]:

##checking the unique departments in the dataset
print(df['department'].unique())

['Customer Support & Service' 'Finance & Accounting' 'Human Resources'
 'Information Technology' 'Legal & Compliance'
 'Manufacturing & Production' 'Quality Assurance & Control'
 'Research & Development' 'Sales & Marketing']

## **CLEANING PROCESS**

In [32]:
df['fna']=df['first_name'].str.isalpha()
df['lna']= df['last_name'].str.isalpha()
df['msn']=df['monthly_salary'].str.isnumeric()
print(df)

    emp_id first_name  last_name                  department  join_date  \
0    CU025    Aubr#ey      Clark  Customer Support & Service 2012-01-04
1    CU026    Preston      Clark  Customer Support & Service 2012-01-04
2    CU031  Josephine     Meyers  Customer Support & Service 2012-01-05
3    CU041      Irene       Ward  Customer Support & Service 2012-01-14
4    CU050      Faith   Gonzales  Customer Support & Service 2012-01-19
..     ...        ...        ...                         ...        ...
520  SA513   Emmanuel  Henderson           Sales & Marketing 2024-12-21
521  SA520    Vincent     Parker           Sales & Marketing 2024-12-21
522  SA523      Clara       Wood           Sales & Marketing 2024-12-29
523  SA528     Krista     Powell           Sales & Marketing 2024-12-29
524  SA530     Sherri       Wood           Sales & Marketing 2024-12-29

    monthly_salary   birth_date    fna   lna   msn
0             6700  29-Mar-1956  False  True  True
1             6700  12-Apr-1956   True  True  True
2             6900   5-Nov-1989   True  True  True
3             6600  20-Sep-1960   True  True  True
4             6500  21-Oct-1961   True  True  True
..             ...          ...    ...   ...   ...
520          10200  14-Mar-1961   True  True  True
521          10200  28-Apr-1961   True  True  True
522          10300   5-Nov-1959   True  True  True
523          10100  29-Mar-1962   True  True  True
524          10300  19-Dec-1959   True  True  True

[505 rows x 10 columns]

### **filtering out the fault rows**

In [33]:
print("code with alpha numeric data issues")
df2 = df.query('fna == False or lna == False or msn == False')
print(df2)

code with alpha numeric data issues
    emp_id  first_name  last_name                  department  join_date  \
0    CU025     Aubr#ey      Clark  Customer Support & Service 2012-01-04
39   CU335      Selena      James  Customer Support & Service 2020-05-11
183  IN185       Isaac  Peter+son      Information Technology 2016-03-28
232  LE280  Pris$cilla      Lewis          Legal & Compliance 2019-02-11
261  LE511       Betty    Ada$$ms          Legal & Compliance 2024-12-21
299  MA215      Claire    Bennett  Manufacturing & Production 2017-11-22
365  MA525     Gilbert       Cruz  Manufacturing & Production 2024-12-29

    monthly_salary   birth_date    fna    lna    msn
0             6700  29-Mar-1956  False   True   True
39           6&500  29-Mar-1950   True   True  False
183           9600   2-Jan-1966   True  False   True
232          10900  16-Jan-1955  False   True   True
261          10700   7-Sep-1957   True  False   True
299          9 300   1-Jan-1950   True   True  False
365          73 00  15-Feb-1950   True   True  False

### **cleaning the first name rows**

In [35]:
df['first_name'] = df['first_name'].str.replace('#' , '')
df['first_name'] = df['first_name'].str.replace('$', '')
df['last_name']  = df['last_name'].str.replace('+', '')
df['last_name'] = df['last_name'].str.replace('$','')
df['monthly_salary'] = df['monthly_salary'].str.replace('&','')
df['monthly_salary'] = df['monthly_salary'].str.replace(' ','')

for col in ['fna', 'lna', 'msn']:
    if col in df.columns:
        df.drop(col, axis=1, inplace=True)

# df.drop('fna',axis=1,inplace=True)
# df.drop('lna',axis=1,inplace=True)
# df.drop('msn',axis=1,inplace=True)
print("Rows with alphanumeric data issues fixed")
print("==========================================")
print(df)

Rows with alphanumeric data issues fixed
==========================================
    emp_id first_name  last_name                  department  join_date  \
0    CU025     Aubrey      Clark  Customer Support & Service 2012-01-04
1    CU026    Preston      Clark  Customer Support & Service 2012-01-04
2    CU031  Josephine     Meyers  Customer Support & Service 2012-01-05
3    CU041      Irene       Ward  Customer Support & Service 2012-01-14
4    CU050      Faith   Gonzales  Customer Support & Service 2012-01-19
..     ...        ...        ...                         ...        ...
520  SA513   Emmanuel  Henderson           Sales & Marketing 2024-12-21
521  SA520    Vincent     Parker           Sales & Marketing 2024-12-21
522  SA523      Clara       Wood           Sales & Marketing 2024-12-29
523  SA528     Krista     Powell           Sales & Marketing 2024-12-29
524  SA530     Sherri       Wood           Sales & Marketing 2024-12-29

    monthly_salary   birth_date
0             6700  29-Mar-1956
1             6700  12-Apr-1956
2             6900   5-Nov-1989
3             6600  20-Sep-1960
4             6500  21-Oct-1961
..             ...          ...
520          10200  14-Mar-1961
521          10200  28-Apr-1961
522          10300   5-Nov-1959
523          10100  29-Mar-1962
524          10300  19-Dec-1959

[505 rows x 7 columns]

### **Working with dates**

In [37]:
##checking the join dates
from datetime import datetime
df['join_date2']=df['join_date']
df['join_date']=pd.to_datetime(df['join_date'],format="%d-%b-%Y",
                               errors='coerce')
print("date with invalid join date")
print("============================")
df2 =df[df['join_date'].isna()]
print (df2)
df= df.dropna()
df.drop('join_date2', axis=1, inplace=True)

date with invalid join date
============================
Empty DataFrame
Columns: [emp_id, first_name, last_name, department, join_date, monthly_salary, birth_date, join_date2]
Index: []

### **fixing the join date column**

In [38]:
##rows with join date fixed are
print("rows with join date fixed")
print("===========================")
print(df)

rows with join date fixed
===========================
    emp_id first_name  last_name                  department  join_date  \
0    CU025     Aubrey      Clark  Customer Support & Service 2012-01-04
1    CU026    Preston      Clark  Customer Support & Service 2012-01-04
2    CU031  Josephine     Meyers  Customer Support & Service 2012-01-05
3    CU041      Irene       Ward  Customer Support & Service 2012-01-14
4    CU050      Faith   Gonzales  Customer Support & Service 2012-01-19
..     ...        ...        ...                         ...        ...
520  SA513   Emmanuel  Henderson           Sales & Marketing 2024-12-21
521  SA520    Vincent     Parker           Sales & Marketing 2024-12-21
522  SA523      Clara       Wood           Sales & Marketing 2024-12-29
523  SA528     Krista     Powell           Sales & Marketing 2024-12-29
524  SA530     Sherri       Wood           Sales & Marketing 2024-12-29

    monthly_salary   birth_date
0             6700  29-Mar-1956
1             6700  12-Apr-1956
2             6900   5-Nov-1989
3             6600  20-Sep-1960
4             6500  21-Oct-1961
..             ...          ...
520          10200  14-Mar-1961
521          10200  28-Apr-1961
522          10300   5-Nov-1959
523          10100  29-Mar-1962
524          10300  19-Dec-1959

[505 rows x 7 columns]

### **Fixing the column headers**

In [39]:
print("fix the column headers")
print("==========================")
df.columns=df.columns.str.replace(' ','_')
print(df)

fix the column headers
==========================
    emp_id first_name  last_name                  department  join_date  \
0    CU025     Aubrey      Clark  Customer Support & Service 2012-01-04
1    CU026    Preston      Clark  Customer Support & Service 2012-01-04
2    CU031  Josephine     Meyers  Customer Support & Service 2012-01-05
3    CU041      Irene       Ward  Customer Support & Service 2012-01-14
4    CU050      Faith   Gonzales  Customer Support & Service 2012-01-19
..     ...        ...        ...                         ...        ...
520  SA513   Emmanuel  Henderson           Sales & Marketing 2024-12-21
521  SA520    Vincent     Parker           Sales & Marketing 2024-12-21
522  SA523      Clara       Wood           Sales & Marketing 2024-12-29
523  SA528     Krista     Powell           Sales & Marketing 2024-12-29
524  SA530     Sherri       Wood           Sales & Marketing 2024-12-29

    monthly_salary   birth_date
0             6700  29-Mar-1956
1             6700  12-Apr-1956
2             6900   5-Nov-1989
3             6600  20-Sep-1960
4             6500  21-Oct-1961
..             ...          ...
520          10200  14-Mar-1961
521          10200  28-Apr-1961
522          10300   5-Nov-1959
523          10100  29-Mar-1962
524          10300  19-Dec-1959

[505 rows x 7 columns]

# **Load the data to Oracle Database**

In [43]:
import sqlalchemy as odb
username="apps_user"
password= "appuser12345"
dsn= "10.100.64.53:1521/?service_name=xepdb1"
conn_str="oracle+oracledb://"+username+":"+password+"@"+dsn
print("connection string used:")
print(conn_str)
eng= odb.create_engine(conn_str)
df.to_sql('emp_salary_data', con=eng, if_exists='append', index=False)

connection string used:
oracle+oracledb://apps_user:appuser12345@10.100.64.53:1521/?service_name=xepdb1

-1